#შექმენით პრეზენტაცია სადაც ახსნით რა არის compiler, interpered and compiled ენებს შორის განსხვავებას, რა არის ცვლადები (ნებისმიერი პრეზენტაციის პროგრამის გამოყენებით (თუ არ გახსოვთ რაიმე ჩამოთვლილი საკითხებიდან ჩემი რჩევა იქნება უყუროთ დღევანდელი გაკვეთილის ჩანაწერის ბოლო 1 საათს.
 

#1.compiler არის პროგრამა რომელიც ეხმარება პროცესორს გადასცეს კოდი, თუ პროგრამირების ენა არის მაღალი ლეველის ანუ ეს იმას ნიშნავს რომ ადამინის ენასთან არის ახლოს მსგავს ენად შეგვიძლია ჩავთვალოთ პითონი, ხოლო დაბალი ლეველის ენა არის კომპიუტერის ენასთან ახლოს ანუ პროცესორთან და კომპიუტერი ბევრად ნაკლებ დროს ანდომებს კოდის გადათარგმნას მსგავს ენდებად ითვლებიან მაგალითდ: C C++ C# JAVA. 

#Interpreter  არის პოგრამა რომელიც ახდენს კოდის მანქნაურ ენაზე გადათარგმნას ეტაპობრივად ანუ ხაზობრივად როდესაც წაიკითხავს ერთ ხაზს, შემდგომ ზუსად ამავეს იმეორებს თავიდან მეორე ხაზზე და ასე მოყვება მთლიან კოდს.

#კომპილირებული და ინტერპრეტირებული ენები, ზოგიერთი ენა შეიძლება იყოს ნაწილობრივ კომპილირებული და ნაწილობრივ ინტერპრეტირებული. მაგალითად:
#Java – ჯერ კომპილირდება Bytecode-ად (JVM), შემდეგ კი ინტერპრეტატორით სრულდება.