#მოიყვანეთ while loop-ის მაგალითი და კომენტარის სახით ახსენით, თუ როგორ მუშაობს while ციკლი;
wanted_number=3
number=int(input("enter your num:"))

while number != wanted_number: 
   number=int(input("enter your num:"))
   if number==3:
    print("you  have entered correct number:")


#ამ მაგალთში ჩვენ განვიხილავთ While-ციკლს, While ციკლი არის პირობა რომელიც გვეხმარება იმაში რომ სანამ რაღაც არ დაკმაყოფილდება მუდამ გაეშვას ეს მოთხოვნა მაგალითად მოცემული გვაქვს ზევით მოცემული ჩვენ ზევით მაგალითში ცვალადში შევინახეთ რაღაც რიცხვი რაც გვინდოდა რომ მომხმარებელს შემოტანა შემდგომ  თუ მომხმარებელი არ შემოიტანდა ამ რიცხვს while ციკლი დატრიალდებოდა და გამოუტანდა კიდევ შესაყვან inputs და ასე უსასრულოდ გაგრძელდებოდა მანამ სანამ შემოყვანილი რიცხვი არ იქნებოდა 3 და ბოლოს უბრალოდ დავამატეთ რომ თუ რიცხვი უდრის ანუ number = 3 ს  გამოიტანოს რომ მან ჩაწერა სწორი რიცხვი  მაგრამ if რომ მოვშოროთ არაფერი არ შეიცვლება while ციკლი ისევ იგიევნაირად იმუშავებდა თუ  3 შემოვიდოდა გაჩერდებოდა რაც while ციკლში გვაქ გადაცემული რომ თუ რიცხვი  არ უდრის ჩვენ შემოტანილ ცვლად მანამ იტრიალოს ციკლმა ხოლო როდესაც ეს პირობა დაკმაყოფილდებოდა ციკლიც შესაბამისად გაჩერდებოდა.

#  როდის გამოვიყენოთ while ციკლი?
#1.თუ წინასწარ არ იცი იტერაციების რაოდენობა.

#2.როცა გინდა რომ ციკლმა  იმუშავოს მანამ, სანამ პირობა მართალია.

#3.ალგორითმებში, სადაც რთული ლოგიკური პირობებია.
    
    
     
       
   
 


    
