# კომენტარის სახით ახსენით თუ რა განსხვავებაა for loop-სა და while loop-ს შორის


#while loop-ს ვიყენებთ მანამ სანამ რამე პირობა არ მივა სიმართლემდე სხვა შემთხვევში უსასრულოდ იტრიალებს ხოლო for loop-ით ჩვენ შეგვიძლია არგუმენტს გადავუყვეთ დავანაწევროთ და მივცეთ კონკრეტული არგუმენტი რომ i გაიზაროდს მანაამ სანამ ჩვენ მიცემულ არგუმენტამდე არმივა ჩვენ ასევე შეგვიძლია სიგრძის ნაცვლად ანუ range-ის ნაცვლად გამოვიყენოთ ცვლადი რასაც გვინდა რომ მივწვდეთ   ან კიდევ i ის ნაცვლად შეგვიძლია ჩავწეროთ ცვლადი როემლიც მოერგება ჩვენ მიერ გადაცემულ არგუმენტს.

