# კომენტარის სახით ჩამოწერეთ and და or ლოგიკური ოპერატორების ყველა შესაძლო გამოსახულება. ამასთანავე, მიუწერეთ თუ რა იქნება თითოეული ოპერაციის შედეგი.

#and ით შეგიძლია შემოვიტანოთ ერთზე მეტი აუცილებელი პირობა if-ში ეს იმას ნიშნავ რომ იგი აუცილებლად დაკმაყოფილებული უნდა იყოს თუ არადა იგი გამოიტანს False example: true and false ამ მაგალითში ერთ პირობა შეესაბამება სიმართლეს ხოლო მეორე არ შესაბამება აქ ამიტომაც False გამოვა სხვა შემთხვევში რომ ყოფილიყო True and True ამ შემთხვევაში აუცილებლად შესრულდებოდა პირობა რადგან ორივე პირობა დაკმაყოფილებულია

#or არის პრიობა როდესაც ჩვენ შემოგვაქ ერთზე მეტი პირობა მაგრამ არ მოითხოვს დაკმაყოფილების აუცილებლობას მაგალითად თუ ეს არ დაკმაყოფილდა იყოს ან ეს ან ეს მაგალით:
# True or false or false or true კოდი გაჩერდება პირველივე ხაზზე და გამოიტანს Trueს რადგან ჩვენ სხვა შემთხვევა მივეცით იმ შემთხვევაში თუ არ დაკმაყოფილდებოდა პირველი  ჩვენ არმიგვიცია კოდისთვის დატვირთვა რომ დაკმაყოფილებულიყო ორივე ყველა პრიობა ანუ როდესაც ჩვენ შეგხვდვება true or true= true; true or false = false,  false or false = false

#MUST KNOW INFORMATION!: პირველ რიგში ყოველთვის სრულდება not ოპერატორი შემდეგ and და ბოლოს or ოპერატორი.