
#მომხმარებელს შემოატანინე მისი შემაფასებელი ქულა (0-დან 100-ის ჩათვლით).
 #იმ შემთხვევაში თუ შემოტანილი ქულა მეტია ან ტოლია 90-ის, ტერმინალში გამოიტანე "Grade A".
# თუ მისი ქულა მეტია ან ტოლია 70-ზე გამოიტანე "Grade B". 
 #თუ მომხმარებლის ქულა მეტია ან ტოლია 50-ზე ტერმინალში დაბეჭდე "Grade C"
 #ყველა დანარჩენ შემთხვევაში გამოიტანე  "Grade F"

Grade=int(input("Enter your Grade:"))

if Grade>=90:
    print("Grade A")
elif Grade>=70:
    print("Grade B")
elif Grade>=50:
    print("Grade C") 
else:
    print("Grade F")