# შექმენით პროგრამა, სადაც მომხმარებელს შემოატანინებთ სახელს, გვარს და ასაკს, შემოტანილი მნიშვნელობები შეინახეთ ცვლადებში, ცვლადებსა დაარქვით ისეთი სახელები რომელიც შეესაბამება მნიშვნელობებს, აგრეთვე კომენტარებით ახსენით რა არის ფუნქცია + ყველა ხაზი დააკომენტარეთ და ახსენით თითოეულ ხაზზე რას აკეთებთ.

# სახელის შემოყვანა inputi_ის მეშვეობით
name=input("Enter your name:")
#გვარის შემოყვანა inputi_ის მეშვეობით
last_name=input("Enter your last_name")
#ასაკის შემოყვანა input_ის მეშვეობით
age=input("enter your age:")

